# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [1]:
# Import here.
import numpy as np
import pandas as pd

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [2]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [3]:
# Count by hand. (lol kidding)
row_count = df_food.count()
print(row_count)

GPA                 123
Gender              125
breakfast           125
calories_chicken    125
calories_day        106
                   ...
type_sports          99
veggies_day         125
vitamins            125
waffle_calories     125
weight              123
Length: 61, dtype: int64

What are the columns and their types in this data set?

In [10]:
# Show the column names and their types.
print(df_food.dtypes)
print(df_food.info())

GPA                  object
Gender                int64
breakfast             int64
calories_chicken      int64
calories_day        float64
                     ...
type_sports          object
veggies_day           int64
vitamins              int64
waffle_calories       int64
weight               object
Length: 61, dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   GPA                           123 non-null    object
 1   Gender                        125 non-null    int64
 2   breakfast                     125 non-null    int64
 3   calories_chicken              125 non-null    int64
 4   calories_day                  106 non-null    float64
 5   calories_scone                124 non-null    float64
 6   coffee                        125 non-null    int64
 7   comfort_food                  124 non-null    object
 8   comfort_food_reasons          123 non-null    object
 9   comfort_food_reasons_coded    106 non-null    float64
 10  cook                          122 non-null    float64
 11  comfort_food_reasons_coded.1  125 non-null    int64
 12  cuisine                       108 non-null    float64
 13  diet_current                  124 non-null    object
 14  diet_current_coded            125 non-null    int64
 15  drink                         123 non-null    float64
 16  eating_changes                122 non-null    object
 17  eating_changes_coded          125 non-null    int64
 18  eating_changes_coded1         125 non-null    int64
 19  eating_out                    125 non-null    int64
 20  employment                    116 non-null    float64
 21  ethnic_food                   125 non-null    int64
 22  exercise                      112 non-null    float64
 23  father_education              124 non-null    float64
 24  father_profession             122 non-null    object
 25  fav_cuisine                   123 non-null    object
 26  fav_cuisine_coded             125 non-null    int64
 27  fav_food                      123 non-null    float64
 28  food_childhood                124 non-null    object
 29  fries                         125 non-null    int64
 30  fruit_day                     125 non-null    int64
 31  grade_level                   125 non-null    int64
 32  greek_food                    125 non-null    int64
 33  healthy_feeling               125 non-null    int64
 34  healthy_meal                  124 non-null    object
 35  ideal_diet                    124 non-null    object
 36  ideal_diet_coded              125 non-null    int64
 37  income                        124 non-null    float64
 38  indian_food                   125 non-null    int64
 39  italian_food                  125 non-null    int64
 40  life_rewarding                124 non-null    float64
 41  marital_status                124 non-null    float64
 42  meals_dinner_friend           122 non-null    object
 43  mother_education              122 non-null    float64
 44  mother_profession             123 non-null    object
 45  nutritional_check             125 non-null    int64
 46  on_off_campus                 124 non-null    float64
 47  parents_cook                  125 non-null    int64
 48  pay_meal_out                  125 non-null    int64
 49  persian_food                  124 non-null    float64
 50  self_perception_weight        124 non-null    float64
 51  soup                          124 non-null    float64
 52  sports                        123 non-null    float64
 53  thai_food                     125 non-null    int64
 54  tortilla_calories             124 non-null    float64
 55  turkey_calories               125 non-null    int64
 56  type_sports                   99 non-null     object
 57  veggies_day                   125 non-null    int64
 58  vitamins                      125 non-null    int64
 59  waffle_calories               125 non-null    int64
 60  weight                        123 non-null    object
dtypes: float64(20), int64(27), object(14)
memory usage: 59.7+ KB
None

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [20]:
# Remove ‚Äòem.

# Keep these columns
columns_to_keep = ['calories_day', 'weight']

# Only have df_food use these cols
df_food = df_food[columns_to_keep]

df_food.value_counts()

     calories_day                    weight
0             NaN                       187
1             3.0                       155
2             4.0  I'm not answering this.
3             3.0             Not sure, 240
4             2.0                       190
..            ...                       ...
120           4.0                       156
121           2.0                       180
122           NaN                       120
123           4.0                       135
124           NaN                       135

[125 rows x 2 columns]

calories_day  weight
3.0           140                         6
              185                         5
              150                         5
              125                         5
              155                         4
                                         ..
              137                         1
              138                         1
2.0           105                         1
3.0           160                         1
4.0           I'm not answering this.     1
Name: count, Length: 67, dtype: int64

What about `NaN`s? How many are there?

In [19]:
# Count ‚Äòem.
df_food.isna().sum()

df_food.value_counts()

calories_day  weight
3.0           140                         6
              185                         5
              150                         5
              125                         5
              155                         4
                                         ..
              137                         1
              138                         1
2.0           105                         1
3.0           160                         1
4.0           I'm not answering this.     1
Name: count, Length: 67, dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [21]:
# Drop ‚Äòem.
df_food.dropna()

     calories_day                    weight
1             3.0                       155
2             4.0  I'm not answering this.
3             3.0             Not sure, 240
4             2.0                       190
5             3.0                       190
..            ...                       ...
118           3.0                       140
119           3.0                       185
120           4.0                       156
121           2.0                       180
123           4.0                       135

[104 rows x 2 columns]

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [22]:
# Fix that.
df_food['weight'] = pd.to_numeric(df_food['weight'], errors='coerce' )
df_food = df_food.dropna()
print(df_food)

     calories_day  weight
1             3.0   155.0
4             2.0   190.0
5             3.0   190.0
6             3.0   180.0
7             3.0   137.0
..            ...     ...
118           3.0   140.0
119           3.0   185.0
120           4.0   156.0
121           2.0   180.0
123           4.0   135.0

[101 rows x 2 columns]

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [25]:
# Savey save!
df_food.to_csv('data/clean_food_coded.csv', index='False')

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [28]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('/Users/laure1/Desktop/CTP/my-fork-2024-DS-Fri-1230/Week-02-DS-Overview-and-Data/data/manager_salary_2021.tsv', sep = '\t')
print(df_salary)

                Timestamp How old are you?  What industry do you work in?  \
0      4/27/2021 11:02:10            25-34   Education (Higher Education)
1      4/27/2021 11:02:22            25-34              Computing or Tech
2      4/27/2021 11:02:38            25-34  Accounting, Banking & Finance
3      4/27/2021 11:02:41            25-34                     Nonprofits
4      4/27/2021 11:02:42            25-34  Accounting, Banking & Finance
...                   ...              ...                            ...
28057  7/12/2024 22:52:01            35-44                    Health care
28058  7/23/2024 17:51:03            25-34              Computing or Tech
28059  7/24/2024 12:22:58            18-24  Accounting, Banking & Finance
28060  7/26/2024 11:20:45            18-24              Computing or Tech
28061   8/20/2024 1:06:13            25-34                    Health care

                                      Job title  \
0            Research and Instruction Librarian
1      Change & Internal Communications Manager
2                          Marketing Specialist
3                               Program Manager
4                            Accounting Manager
...                                         ...
28057                              Veterinarian
28058                         Systems Architect
28059                 Risk Management Associate
28060                                        IT
28061                    Clinical physiologist

      If your job title needs additional context, please clarify here:  \
0                                                    NaN
1                                                    NaN
2                                                    NaN
3                                                    NaN
4                                                    NaN
...                                                  ...
28057                                                NaN
28058                                                NaN
28059                                                NaN
28060                                                NaN
28061                                                NaN

      What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  \
0                                                 55,000
1                                                 54,600
2                                                 34,000
3                                                 62,000
4                                                 60,000
...                                                  ...
28057                                             135000
28058                                             109000
28059                                               1200
28060                                               1700
28061                                            1200000

       How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.  \
0                                                    0.0
1                                                 4000.0
2                                                    NaN
3                                                 3000.0
4                                                 7000.0
...                                                  ...
28057                                                NaN
28058                                                NaN
28059                                                0.0
28060                                               10.0
28061                                                NaN

      Please indicate the currency  \
0                              USD
1                              GBP
2                              USD
3                              USD
4                              USD
...                            ...
28057                          USD
28058                          USD
28059                          USD
28060                          USD
28061                        Other

      If "Other," please indicate the currency here:   \
0                                                 NaN
1                                                 NaN
2                                                 NaN
3                                                 NaN
4                                                 NaN
...                                               ...
28057                                             NaN
28058                                             NaN
28059                                             NaN
28060                                             NaN
28061                                             NGN

      If your income needs additional context, please provide it here:  \
0                                                    NaN
1                                                    NaN
2                                                    NaN
3                                                    NaN
4                                                    NaN
...                                                  ...
28057                                                NaN
28058                                                NaN
28059                                                NaN
28060                                                NaN
28061                                                NaN

      What country do you work in?  \
0                    United States
1                   United Kingdom
2                               US
3                              USA
4                               US
...                            ...
28057               United States
28058                          USA
28059                      Myanmar
28060                        Burma
28061                     Nigeria

      If you're in the U.S., what state do you work in?  \
0                                         Massachusetts
1                                                   NaN
2                                             Tennessee
3                                             Wisconsin
4                                        South Carolina
...                                                 ...
28057                                          Missouri
28058                                           Georgia
28059                                          Colorado
28060                                               NaN
28061                                               NaN

      What city do you work in?  \
0                        Boston
1                     Cambridge
2                   Chattanooga
3                     Milwaukee
4                    Greenville
...                         ...
28057               Wentzville
28058                   Atlanta
28059                    Yangon
28060                    Yangon
28061                     Lagos

      How many years of professional work experience do you have overall?  \
0                                              5-7 years
1                                           8 - 10 years
2                                            2 - 4 years
3                                           8 - 10 years
4                                           8 - 10 years
...                                                  ...
28057                                      11 - 20 years
28058                                          5-7 years
28059                                        2 - 4 years
28060                                        2 - 4 years
28061                                        2 - 4 years

      How many years of professional work experience do you have in your field?  \
0                                              5-7 years
1                                              5-7 years
2                                            2 - 4 years
3                                              5-7 years
4                                              5-7 years
...                                                  ...
28057                                      11 - 20 years
28058                                          5-7 years
28059                                        2 - 4 years
28060                                     1 year or less
28061                                        2 - 4 years

      What is your highest level of education completed? What is your gender?  \
0                                        Master's degree                Woman
1                                         College degree           Non-binary
2                                         College degree                Woman
3                                         College degree                Woman
4                                         College degree                Woman
...                                                  ...                  ...
28057                 Professional degree (MD, JD, etc.)                Woman
28058                                     College degree                  Man
28059                                       Some college                  Man
28060                                       Some college                  Man
28061                                     College degree                Woman

      What is your race? (Choose all that apply.)
0                                           White
1                                           White
2                                           White
3                                           White
4                                           White
...                                           ...
28057                                       White
28058                                       White
28059                     Asian or Asian American
28060                     Asian or Asian American
28061                   Black or African American

[28062 rows x 18 columns]

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [29]:
# Count by hand. I‚Äôm dead serious.
print(df_salary.shape)
print(df_salary.size)

(28062, 18)
505116

What are the columns and their types?

In [30]:
# Show the column names and their types.
print(df_salary.dtypes)

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [33]:
# Rename ‚Äòem.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race
col_names = ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_comp', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_edu_completed', 'gender', 'race']

df_salary.columns = col_names

print(df_salary.dtypes)

timestamp                 object
age                       object
industry                  object
title                     object
title_context             object
salary                    object
additional_comp          float64
currency                  object
other_currency            object
salary_context            object
country                   object
state                     object
city                      object
total_yoe                 object
field_yoe                 object
highest_edu_completed     object
gender                    object
race                      object
dtype: object

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [35]:
# List the unique industries and a count of their instances.
df_salary['industry'].value_counts()

industry
Computing or Tech                          4699
Education (Higher Education)               2464
Nonprofits                                 2419
Health care                                1896
Government and Public Administration       1889
                                           ...
Gaming (Gambling)                             1
Regulatory Affairs- nutraceuticals            1
Manufacturing : corporate admin support       1
Real Estate Investment Support                1
Wine & Spirits                                1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [38]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']

df_salary_tech.head()

,timestamp,age,industry,title,title_context,salary,additional_comp,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_edu_completed,gender,race
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [39]:
# Sanity Check 
df_salary_tech['industry'].value_counts()
print(df_salary_tech['industry'].unique())

['Computing or Tech']

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [42]:
# Filtery filter for just the jobs that pay in USD!
df_salary_tech_usd = df_salary_tech[df_salary_tech['currency'] == 'USD']

df_salary_tech_usd.head()

,timestamp,age,industry,title,title_context,salary,additional_comp,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_edu_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,USA,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [43]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_salary_tech_usd['country'].value_counts()

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Pakistan                       1
Puerto Rico                    1
America                        1
Uniyed states                  1
Burma                          1
Name: count, Length: 76, dtype: int64

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [45]:
# Replace them all with 'US'.
us_replacements = {
    'United States': 'US',
    'USA': 'US',
    'U.S.': 'US',
    'United States of America': 'US'
}

# Replace all instances in dict with 'US'
df_salary_tech_usd.loc[:5, 'country'] = df_salary_tech_usd.loc[:4, 'country'].replace(us_replacements)

df_salary_tech_usd['country'].value_counts()

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Pakistan                       1
Puerto Rico                    1
America                        1
Uniyed states                  1
Burma                          1
Name: count, Length: 76, dtype: int64

Have a look at the count of each unique country again now.

In [46]:
# Count again.
df_salary_tech_usd['country'].value_counts()

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Pakistan                       1
Puerto Rico                    1
America                        1
Uniyed states                  1
Burma                          1
Name: count, Length: 76, dtype: int64

Did you notice anything interesting?

In [75]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.

col_names = ['timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 'additional_comp', 'currency', 'other_currency', 'salary_context', 'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_edu_completed', 'gender', 'race']

df_salary.columns = col_names

# Convert all country names to uppercase for consistency of dict
df_salary['country'] = df_salary['country'].str.upper()

# Dictionary for common corrections. I added as many as I could before I went crazy
country_replacements = {
    'UNITED STATES': 'US',
    'USA': 'US',
    'US>': 'US',
    'USAB': 'US',
    'UNITED STATESP': 'US',  # Corrected typo
    'UNITED STTES': 'US',    # Corrected typo
    'UNTED STATES': 'US',    # Corrected typo
    'UNITED KINGDOM': 'UK',
    'UK NORTHERN ENGLAND': 'UK',
    'U.S.': 'US',
    'FOR THE US GOVERNMENT, BUT POSTED OVERSEAS': 'US',
    'CAN': 'CANADA',
    'AUS': 'AUSTRALIA',
    'AUSTRALI': 'AUSTRALIA',  # Corrected typo
    'NEDERLAND': 'NETHERLANDS',
    'NL': 'NETHERLANDS',
    'DANMARK': 'DENMARK',
    'IS': 'ISRAEL',
    "UNITED STATTES": 'US',
    "UNIITED STATES": 'US',
    'BURMA': 'MYANMAR',
    # Add other corrections if necessary
}

# Apply the replacements
df_salary['country'] = df_salary['country'].replace(country_replacements)

# Remove special characters or clean up data using regex
df_salary['country'] = df_salary['country'].str.replace(r'[^\w\s]', '', regex=True).str.strip()

# Normalize the corrected country names again 
df_salary['country'] = df_salary['country'].str.upper()

In [76]:
# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.

print(df_salary['country'].value_counts())

# New count for US is 22964, which is > old count of 1576

country
US                                          22964
CANADA                                       1679
UK                                           1339
AUSTRALIA                                     390
GERMANY                                       195
                                            ...
WALES UNITED KINGDOM                            1
SOMALIA                                         1
FROM ROMANIA BUT FOR AN US BASED COMPANY        1
COTE DIVOIRE                                    1
CAMBODIA                                        1
Name: count, Length: 226, dtype: int64

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [58]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.

# Remove unwanted characters from the 'salary' column using regex
df_salary_tech_usd.loc[:, 'salary'] = df_salary_tech_usd['salary'].replace({'$': '', ',': ''}, regex=True)

# Convert the 'salary' column to numeric
df_salary_tech_usd.loc[:, 'salary'] = pd.to_numeric(df_salary_tech_usd['salary'], errors='coerce')

# Drop rows where 'salary' is NaN 
df_salary_tech_usd_clean = df_salary_tech_usd.dropna(subset=['salary'])

# Group by 'state' and calculate min, mean, and max salary
salary_stats = df_salary_tech_usd_clean.groupby('state')['salary'].agg(['min', 'mean', 'max']).reset_index()

salary_stats.columns = ['state', 'min_salary', 'mean_salary', 'max_salary']

print(salary_stats)

                             state  min_salary    mean_salary  max_salary
0                          Alabama     35000.0  117400.000000    350000.0
1                          Arizona     35000.0   97833.333333    145000.0
2                         Arkansas         4.0   58001.000000     95000.0
3                       California         0.0  153286.988827    520000.0
4             California, Colorado    176000.0  176000.000000    176000.0
5             California, Maryland     81500.0   81500.000000     81500.0
6               California, Oregon    200000.0  200000.000000    200000.0
7                         Colorado     49400.0  109291.891892    165000.0
8                      Connecticut     68000.0  161610.000000    270000.0
9                         Delaware    169000.0  169000.000000    169000.0
10            District of Columbia     59000.0  142923.076923    200000.0
11  District of Columbia, Virginia    109200.0  109200.000000    109200.0
12                         Florida     28800.0  210711.000000   2600000.0
13                         Georgia     29120.0  115297.647059    242000.0
14                           Idaho     74860.0  105465.000000    170000.0
15                        Illinois     36000.0  117555.571429    228800.0
16                         Indiana     15000.0   82875.000000    140000.0
17                            Iowa     63000.0  101200.000000    142000.0
18                          Kansas     41500.0  109666.666667    167000.0
19                        Kentucky     62000.0  102500.000000    125000.0
20                       Louisiana     75000.0   80500.000000     84000.0
21           Louisiana, Washington    117000.0  117000.000000    117000.0
22                           Maine     50000.0  103833.333333    173000.0
23                        Maryland     62000.0  119955.461538    176000.0
24                   Massachusetts     41000.0  125899.155844    400000.0
25                        Michigan     41600.0   95758.823529    235000.0
26     Michigan, Texas, Washington    340000.0  340000.000000    340000.0
27                       Minnesota     52124.0  101064.941176    210000.0
28                        Missouri        80.0   80339.923077    200000.0
29                         Montana     65000.0  112666.666667    145000.0
30                        Nebraska     43000.0   76736.000000    140000.0
31                          Nevada    107100.0  124550.000000    142000.0
32                   New Hampshire        55.0   87175.833333    130000.0
33                      New Jersey     67500.0  124090.909091    192000.0
34            New Jersey, New York    135000.0  137500.000000    140000.0
35                      New Mexico     82000.0   95733.333333    115200.0
36                        New York     14000.0  146594.112150    590000.0
37                  North Carolina     29000.0   97841.666667    165000.0
38                            Ohio     42000.0  137066.666667    954000.0
39                        Oklahoma     36958.0   84802.571429    180000.0
40                          Oregon     16200.0  122640.000000    230000.0
41                    Pennsylvania     52000.0  116826.388889    237000.0
42                    Rhode Island     76000.0   99475.000000    122950.0
43                  South Carolina     40000.0   40000.000000     40000.0
44                       Tennessee     61500.0   91750.000000    144000.0
45                           Texas     10700.0  103685.245902    190000.0
46                            Utah     33280.0  105023.333333    176000.0
47                         Vermont     91250.0  105625.000000    120000.0
48                        Virginia     58750.0  115086.696970    378000.0
49                      Washington        72.0  136923.916667    300000.0
50                   West Virginia    120000.0  120000.000000    120000.0
51                       Wisconsin         1.0  145806.888889    920000.0

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [ ]:
# Fix it.

# I fixed it in previous section
print(salary_stats)

Let‚Äôs try that again.

In [ ]:
# Try it again. Yeah!

# Also fixed above
print(salary_stats)

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [62]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.

# Convert 'timestamp' column to datetime using .loc to avoid SettingWithCopyWarning
df_salary_tech_usd.loc[:, 'timestamp'] = pd.to_datetime(df_salary_tech_usd['timestamp'])

# Extract year from the 'timestamp' column
df_salary_tech_usd.loc[:, 'year'] = df_salary_tech_usd['timestamp'].dt.year

# Filter data to only include rows from 2021, 2022, or 2023
df_filtered = df_salary_tech_usd[df_salary_tech_usd['year'].isin([2021, 2022, 2023])]

# Remove unwanted characters from the 'salary' column
df_filtered.loc[:, 'salary'] = df_filtered['salary'].replace({'$': '', ',': ''}, regex=True)

# Convert the 'salary' column to numeric
df_filtered.loc[:, 'salary'] = pd.to_numeric(df_filtered['salary'], errors='coerce')

# Drop rows where 'salary' is NaN 
df_filtered_clean = df_filtered.dropna(subset=['salary'])

# Group by 'state' and calculate min, mean, and max salary
salary_stats_filtered = df_filtered_clean.groupby('state')['salary'].agg(['min', 'mean', 'max']).reset_index()

# Renamed cols
salary_stats_filtered.columns = ['state', 'min_salary', 'mean_salary', 'max_salary']

print(salary_stats_filtered)

                             state  min_salary    mean_salary  max_salary
0                          Alabama     52000.0  138000.000000    350000.0
1                          Arizona     35000.0   97833.333333    145000.0
2                         Arkansas     60000.0   77333.333333     95000.0
3                       California         0.0  153754.893258    520000.0
4             California, Colorado    176000.0  176000.000000    176000.0
5             California, Maryland     81500.0   81500.000000     81500.0
6               California, Oregon    200000.0  200000.000000    200000.0
7                         Colorado     49400.0  109291.891892    165000.0
8                      Connecticut     68000.0  161610.000000    270000.0
9                         Delaware    169000.0  169000.000000    169000.0
10            District of Columbia     59000.0  142923.076923    200000.0
11  District of Columbia, Virginia    109200.0  109200.000000    109200.0
12                         Florida     28800.0  102106.954545    170000.0
13                         Georgia     29120.0  115488.484848    242000.0
14                           Idaho     74860.0  105465.000000    170000.0
15                        Illinois     36000.0  119248.382353    228800.0
16                         Indiana     15000.0   82875.000000    140000.0
17                            Iowa     63000.0  101200.000000    142000.0
18                          Kansas     41500.0  109666.666667    167000.0
19                        Kentucky     62000.0  102500.000000    125000.0
20                       Louisiana     75000.0   80500.000000     84000.0
21           Louisiana, Washington    117000.0  117000.000000    117000.0
22                           Maine     50000.0  103833.333333    173000.0
23                        Maryland     62000.0  119955.461538    176000.0
24                   Massachusetts     41000.0  125660.986842    400000.0
25                        Michigan     41600.0   95758.823529    235000.0
26     Michigan, Texas, Washington    340000.0  340000.000000    340000.0
27                       Minnesota     52124.0  102381.500000    210000.0
28                        Missouri        80.0   80339.923077    200000.0
29                         Montana     65000.0  112666.666667    145000.0
30                        Nebraska     43000.0   76736.000000    140000.0
31                          Nevada    107100.0  124550.000000    142000.0
32                   New Hampshire        55.0   87175.833333    130000.0
33                      New Jersey     67500.0  124090.909091    192000.0
34            New Jersey, New York    135000.0  137500.000000    140000.0
35                      New Mexico     82000.0   95733.333333    115200.0
36                        New York     14000.0  146594.112150    590000.0
37                  North Carolina     29000.0   97250.000000    165000.0
38                            Ohio     42000.0  137066.666667    954000.0
39                        Oklahoma     36958.0   84802.571429    180000.0
40                          Oregon     16200.0  122640.000000    230000.0
41                    Pennsylvania     52000.0  116826.388889    237000.0
42                    Rhode Island     76000.0   99475.000000    122950.0
43                       Tennessee     61500.0   91750.000000    144000.0
44                           Texas     10700.0  103685.245902    190000.0
45                            Utah     33280.0  105023.333333    176000.0
46                         Vermont     91250.0  105625.000000    120000.0
47                        Virginia     58750.0  115086.696970    378000.0
48                      Washington        72.0  137427.774648    300000.0
49                   West Virginia    120000.0  120000.000000    120000.0
50                       Wisconsin         1.0  145806.888889    920000.0

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)